#Дана строка текста, состоящая из букв русского алфавита "О" и "Р". Буква "О" - соответствует выпадению Орла,
#а буква "Р" - соответствует выпадению Решки.Напишите программу, которая подсчитывает наибольшее количество
#подряд выпавших Решек.
s=input()
t=0
while "Р"*(t+1) in s:
    t+=1
if t!=0:
    print(t)
else:
    print(0)