#Задайте строку из набора чисел. Напишите программу, которая покажет большее и меньшее число. В качестве символа-разделителя используйте пробел.
str = '12 32 3 15'
lst = [int(i) for i in str.split()]
print(min(lst))
print(max(lst))